// КОНФИГУРАЦИЯ ФИЛЬТРОВ (ТЕГОВ)
const FILTERS_CONFIG = {
    "Rank: A": [1, 2, 3, 5, 8, 17, 18, 19, 20, 21, 22, 23, 24, 31, 32, 33, 34, 35, 36, 38, 41, 42, 64, 65, 66,
        80, 81, 85],
    "Rank: RE": [4, 6, 7, 9, 10, 11, 12, 13, 14, 16, 15, 25, 26, 27, 28, 29, 30, 37, 39, 40, 43, 44, 
        45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 59, 60, 61, 62, 63, 67, 68, 69, 70, 71, 72, 
        73, 74, 76, 77, 78, 79, 82, 83, 84],
    "Marvel": [20, 23, 32, 38, 42, 78, 79],
    "Fate": [24, 33, 43, 46, 55, 59, 67, 73, 74, 80],
    "Хазбин Отель": [25, 26, 27, 28, 29, 30],
    "Магическая битва": [54, 60, 61, 62, 63],
    "Новый год 2026": [43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 59, 60, 61],
};

// ОСНОВНЫЕ КАРТЫ (показываются на главной)
const FEATURED_CARDS = [83, 81, 79, 78, 68, 67, 66, 65, 64, 63, 62, 59, 42, 41, 35, 34, 33, 30];





// ========== НАСТРОЙКИ ГЕНЕРАЦИИ СПИСКА КАРТ ==========
const MAX_CARD_NUMBER = 85;        // последний номер карты
const EXCLUDED_NUMBERS = [58, 75]; // номера, которых нет (пропускаем) | 58-карта с тайного санты, а 75-дизайн с осколками

// Если какие-то карты — видео (webm), укажите их номера здесь
const VIDEO_NUMBERS = []; // например, [101, 102]

// Автоматически генерируем MANUAL_CARD_LIST
const MANUAL_CARD_LIST = (() => {
    const list = [];
    for (let i = 1; i <= MAX_CARD_NUMBER; i++) {
        if (EXCLUDED_NUMBERS.includes(i)) continue;
        const ext = VIDEO_NUMBERS.includes(i) ? 'webm' : 'webp';
        list.push({ number: i, filename: `card${i}.${ext}` });
    }
    return list;
})();